IDEA StatiCa Open Model
CrossSectionFactory.FillShapeI Method
Compatible with IDEA StatiCa Beta 21.0 - beta
 I shape - massive concrete shape
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public static void FillShapeI(
	CrossSectionParameter css,
	double h,
	double btf,
	double bbf,
	double htf,
	double hbf,
	double tw
)
Public Shared Sub FillShapeI (
	css As CrossSectionParameter,
	h As Double,
	btf As Double,
	bbf As Double,
	htf As Double,
	hbf As Double,
	tw As Double
)
public:
static void FillShapeI(
	CrossSectionParameter^ css,
	double h,
	double btf,
	double bbf,
	double htf,
	double hbf,
	double tw
)
Parameters
css
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
h
Type: System.Double
Total height
btf
Type: System.Double
Width of the upper part
bbf
Type: System.Double
Width of the bottom part
htf
Type: System.Double
Thickness of the upper part
hbf
Type: System.Double
Thickness of the bottom part
tw
Type: System.Double
Thinkness of the web
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace